Examples/ClassDiagram/Exports/swift.mmd
classDiagram
    class Swift_Library["Library"] {
        +playlists Array~Playlist~
        +init(playlists Array~Playlist~)
        +addPlaylist(playlist Playlist)
        +playlist(name String) Playlist?
    }
    class Swift_MediaItem["MediaItem"] {
        +title String
        +duration TimeInterval
        +genre Genre
        +init(title String, duration TimeInterval, genre Genre)
        +play()
    }
    class Swift_Playable["Playable"] {
        <<interface>>
        +title String
        +duration TimeInterval
        +play()
    }
    class Swift_Genre["Genre"] {
        <<enumeration>>
        pop
        rock
        jazz
        classical
        electronic
        spokenWord
    }
    class Swift_Player["Player"] {
        -library Library
        +nowPlaying Playable?
        +init(library Library)
        +play(item Playable)
        +playFirstItem(name String)
    }
    class Swift_Playlist["Playlist"] {
        <<struct>>
        +name String
        +items Array~MediaItem~
        +totalDuration TimeInterval
        +init(name String, items Array~MediaItem~)
        +add(item MediaItem)
    }
    class Swift_Podcast["Podcast"] {
        +host String
        +episodeNumber Int
        +init(title String, duration TimeInterval, host String, episodeNumber Int)
        +play()
    }
    class Swift_Song["Song"] {
        +artist String
        +album String?
        +init(title String, duration TimeInterval, genre Genre, artist String, album String?)
        +play()
    }
    Swift_Playable <|.. Swift_MediaItem
    Swift_MediaItem <|-- Swift_Podcast
    Swift_MediaItem <|-- Swift_Song
    Swift_Library o-- "*" Swift_Playlist : playlists
    Swift_MediaItem *-- "1" Swift_Genre : genre
    Swift_Player *-- "1" Swift_Library : library
    Swift_Player *-- "0..1" Swift_Playable : nowPlaying
    Swift_Playlist o-- "*" Swift_MediaItem : items
    Swift_Song ..> Swift_Genre
